<template>
	<el-row class="aboutme">
		<p>我是一个90后程序员，大学花了两年多的时间自学了PHP，虽然我大学就是计算机专业，学习PHP应该是很轻松的，但是由于没有人带，所以在开始学习的时候也走了不少弯路，又由于大四一年准备考研，导致有一段时间没有接触PHP。</p>
		<p>考研失利，本想再进行二战，但是考虑到自己的专业，并且自己会PHP，所以我没有再去考研，而是选择了就业。</p>
		<p>如今我在北京的一家公司做PHP的开发工作，虽然每天朝九晚五，但是慢慢的也适应了这种快节奏的生活。从毕业到现在也有一年多了，加上从学校跟着老师做项目的那些时间满打满算也有三年多了。现在正在扩展自身的知识范围。</p>
		<p>虽然自己是计算机专业，同时也在做着这方面的工作，但是过去这么长时间了还没有自己的一个博客，一直想做一个，但是由于这样那样的原因都停滞下来了，所以自己在平时的知识或者经验的积累都只能写在word里保存在自己的电脑上，随着文件的增多，看起来非常不方便。</p>
		<p>基于以上原因，终于花了两周的时间搭建了这个博客，借助这个博客可以将自己平时所积累的分享出来，同时可以记录自己的成长之路，以此追忆自己在生活中所留下的足迹，</p>
		<p>关于我</p>
		<p>网名：春风亭老李</p>
		<p>职业：前端开发</p>
		<p>喜欢的书：《金瓶梅》</p>
		<p>喜欢的一句话：不患无位，患所以立，不患莫己知，求为可知也</p>
	</el-row>
</template>

<script>

export default {
  name: 'AbouteMe'
}
</script>

<style lang="less" scoped>
	.aboutme {
		margin: 0 20% 0 15%;
	}
	.aboutme p{
		text-indent: 2;
		line-height: 31px;
		margin: 30px 0;
	}
</style>
